Repository: kellianb/FISE_A3_SE_BECHTEL
Catalog: BackupUtil.I18n/Resources/Strings.*.resx
Languages: fr

# errorSameSourceTarget
source: Source and target paths must not be the same
fr: Les chemins d'accès source et cible ne peuvent pas être identiques

# errorSourceDirTargetFile
source: Source path is a directory, target path must not be a file
fr: Le chemin d'accès source est un dossier, le chemin d'accès cible ne peut pas être un fichier

# errorSourceFileTargetDir
source: Source path is a file, target path must not be a directory
fr: Le chemin d'accès source est un fichier, le chemin d'accès cible ne peut pas être un dossier

# errorSourceInTarget
source: Source path must not be a subdirectory of target path
fr: Le chemin d'accès source ne peut pas être un sous-répertoire du chemin d'accès cible

# errorSourceNotFound
source: Source file or directory not found
fr: Fichier ou dossier source introuvable

# errorSourcePath
source: Source path is not valid
fr: Le chemin d'accès source n'est pas valide

# errorTargetInSource
source: Target path must not be a subdirectory of source path
fr: Le chemin d'accès cible ne peut pas être un sous-répertoire du chemin d'accès source

# errorTargetPath
source: Target path is not valid
fr: Le chemin d'accès cible n'est pas valide

# errorTargetPathEnd
source: Target file path must not end with a '\'
fr: Le chemin d'accès cible ne peut pas se terminer par '\'

# errorFileFormatNotSupported
source: This file format is not supported
fr: Ce format de fichier n'est pas pris en charge

# changeTypeModify
source: Modifying
fr: Modification

# changeTypeCreate
source: Creating
fr: Création

# changeTypeDelete
source: Deleting
fr: Effacement

# changesToFiles
source: These files will be modified:
fr: Ces fichiers seront modifiés :

# changesToDirectories
source: These directories will be modified:
fr: Ces dossiers seront modifiés :

# IsOk
source: Is this ok [Y/n]
fr: Est-ce que cela est correct [Y/n] ?

# selectJobsToRun
source: Please select the jobs that should be run:
fr: Veuillez sélectionner les tâches de sauvegarde à exécuter :

# errorInvalidJobFile
source: The provided job file is invalid.
fr: Le fichier de tâches fourni n'est pas valide.

# errorMaxJobs
source: Max job limit exceeded!
fr: Limite maximale de tâches dépassée !

# selectJobsToRemove
source: Please select the jobs that should be removed:
fr: Veuillez sélectionner les tâches de sauvegarde à supprimer :

# jobName
source: Name
fr: Nom

# jobTargetPath
source: Target path
fr: Chemin cible

# jobSourcePath
source: Source path
fr: Chemin source

# jobDifferential
source: Differential
fr: Différentiel

# jobRecursive
source: Recursive
fr: Récursif

# jobEncrypted
source: Encrypted
fr: Chiffré

# errorEncryptionKeyEmpty
source: Encryption key cannot be empty
fr: La clé de chiffrement ne peut être vide

# langLabel
source: Language
fr: Langue :

# langFrench
source: French
fr: Français

# langEnglish
source: English
fr: Anglais

# selectJobsDialogTitle
source: Select Backup Jobs File
fr: Sélectionner le fichier des Backup Jobs

# addJob
source: Add new job
fr: Ajouter un nouveau job

# changeJobFile
source: Change jobs file
fr: Changer de fichier de jobs

# invalidPath
source: Invalid path selected
fr: Chemin selectionne invalide

# errorNameEmpty
source: Name cannot be empty
fr: Le nom ne peut être vide

# errorInvalidFileMask
source: The provided file mask is invalid.
fr: Le masque de fichiers fourni n'est pas valide.

# jobFileMask
source: File mask
fr: Masque de fichiers

# jobEncryptionKey
source: Encryption key
fr: Clé de chiffrage

# jobEncryptionType
source: Encryption type
fr: Type de chiffrage
